#### ExternalResourceUtils Members

---

|  |
| --- |
| ExternalResourceUtils Class   Methods   See Also |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllExternalResourceReferences(Document) | Gets the ids of all elements which refer to external resources. |
| Public method Static member | GetAllExternalResourceReferences(Document, ExternalResourceType) | Gets the ids of all elements which refer to a specific type of external resource. |

# See Also

ExternalResourceUtils Class

Autodesk.Revit.DB Namespace